app/controllers/kind_teachers_controller.rb

SELECT "kind_teachers".* FROM "kind_teachers"
---
  def index
    @kind_teachers = KindTeacher.all

SELECT "kind_teachers".* FROM "kind_teachers" WHERE "kind_teachers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @kind_teacher = KindTeacher.find(params[:id])

SELECT "kind_teachers".* FROM "kind_teachers" WHERE "kind_teachers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @kind_teacher = KindTeacher.find(params[:id])

INSERT INTO "kind_teachers" ("comment", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "コメントです。"], ["created_at", Thu, 14 Mar 2013 15:58:50 UTC +00:00], ["email", "ogalush@test.jp"], ["name", "おがっぷ"], ["updated_at", Thu, 14 Mar 2013 15:58:50 UTC +00:00]]
---
  def create
    @kind_teacher = KindTeacher.new(params[:kind_teacher])

    respond_to do |format|
      if @kind_teacher.save

SELECT "kind_teachers".* FROM "kind_teachers" WHERE "kind_teachers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "kind_teachers" WHERE "kind_teachers"."id" = ?  [["id", 1]]
---
  def destroy
    @kind_teacher = KindTeacher.find(params[:id])
    @kind_teacher.destroy